clear
clc
i0=5.83;r=0.367;pg=7;	%主减速器传动比，车轮半径，
n=[815 1207 1614 2012 2603 3006 3403 3804]';
ig=[5.56 2.769 1.644 1.00 0.793]';
 %拟合系数矩阵，每个转速对应一列
B=[1326.8 1354.7 1284.4 1122.9 1141.0 1051.2 1233.9 1129.7;
   -416.46 -303.98 -189.75 -121.59 -98.893 -73.714 -84.478 -45.291;
   72.379 36.657 14.524 7.0035 4.4763 2.8593 2.9788 0.71113;
   -5.8629 -2.0553 -0.51184 -0.18517 -0.091077 -0.05138 -0.047449 -0.00075215;
   0.17768 0.043072 0.0068164 0.0018555 0.00068906 0.00035032 0.00028230 -0.000038568];
  %position=;%input('请输入选择的挡位（最高档为1，次高档为0):');	%选择高档或者次高档
 k=[4 5];
 for j=1:2
     m=k(j);
     Ig=ig(m);ua5=0.377*n*r/Ig/i0;f=494.312+0.131*ua5.^2;
     pe=f.*ua5/3600;
        for i=1:length(n)
            b(i)=B(1,i)+B(2,i)*pe(i)+B(3,i)*pe(i)^2+B(4,i)*pe(i)^3+B(5,i)*pe(i)^4;
        end
      b=b';
      nn=600:0.01:4000;	          %连续转速区间
      bb=interp1(n,b,nn,'spline');	       %对油耗b进行三次样条插值
      uaa=0.377*nn*r/Ig/i0;f=494.312+0.131*uaa.^2;pee=f.*uaa/3600;
      qs=pee.*bb./uaa/pg/1.02;	        %百公里油耗
      disp('档位=');
      disp(m);
      plot(uaa,qs);
      xlabel('车速');ylabel('百公里油耗');title('等速百公里油耗曲线');
      hold on,
  end